namespace HebrewVerb.BlazorApp.Common;

public static class TextContent
{
    public const string Home_Welcome = "Добро пожаловать / ברוכימ הבאים";

    public const string Home_Disclaimer = """
        Проект HebVerb &ndash; тренажёр спряжения глаголов иврита,
        с помощью которого можно прокачать свои навыки в использовании
        правильных форм глаголов разных групп.
        """;

    public const string Home_Remark = """
        <b>Важно!</b> Задачей тренажёра не является помощь в заучивании
        их перевода (хотя посмотреть перевод неизвестного глагола здесь
        вполне возможно). Основная цель именно в доведении до автоматизма
        разных форм спряжения. И для такой тренировки у нас есть несколько опций:
        """;
    public const string Home_Card1_Title = "Произвольные глаголы";
    public const string Home_Card1_Subtitle = "Настраиваем фильтры";
    public const string Home_Card1_Text = """
        Работа с произвольными глаголами, подобранными с учётом фильтра (можно указать
        биньян, гизру, модель и время глагола). В этом случае будут предложены карточки
        случайных глаголов, правильные формы которых будут скрыты
        (по умолчанию - 10 глаголов, но число можно настроить).
        """;

    public const string Home_Card2_Title = "Глаголы по выбору";
    public const string Home_Card2_Subtitle = "Создаём свой набор";
    public const string Home_Card2_Text = """
        Тренировка с набором глаголов выбранных индивидуально. Те же карточки, но
        глаголы именно те, с которым хочется поработать отдельно. Наборы, как и фильтры
        из предыдущего пункта можно сохранять в своём аккаунте (после регистрации на сайте).
        """;

    public const string Home_Card3_Title = "Предлоги + Местоимения";
    public const string Home_Card3_Subtitle = "Спрягаем предлоги";
    public const string Home_Card3_Text = """
        В перспективе планируется добавить ещё один вид тренировки для отработки
        спряжения предлогов. Это ещё один из аспектов иврита, который
        хочется доводить до автоматизма. И в этом случае интенсивная практика - самый
        надёжный способ.
        """;

    public const string Home_Card4_Title = "Глаголы + предлоги";
    public const string Home_Card4_Subtitle = "Глагольное управление";
    public const string Home_Card4_Text = """
        В перспективе планируется добавить ещё один вид тренировки для отработки
        употребляемых с глаголом предлогов. Это ещё один из аспектов иврита, который
        хочется доводить до автоматизма. И в этом случае интенсивная практика - самый
        надёжный способ.
        """;


    public const string Home_Card5_Title = "Справочная информация";
    public const string Home_Card5_Subtitle = "Повторяем правила:";
    public const string Home_Card5_Text = """
        Небольшой набор граматических таблиц для различных биньянов с описанием некоторых
        моделей спряжения, гизры и другие особенности.
        """;


    public const string Home_Card6_Title = "Расширение возможностей";
    public const string Home_Card6_Subtitle = "Дополнительные функции";
    public const string Home_Card6_Text = """
        При регистрации на сайте появляется возможность сохранять свои настройки (фильтры,
        наборы глаголов и пр.), но с определёнными ограничениями по количеству сохранённых опций. 
        Для снятия этих ограничений можно просто повысить свой статус.
        """;
}
